Tekla Open API Reference for Tekla Structures 2025
ShapeItem.DeleteMetadata Method
 Delete the Shape item's metadata.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DeleteMetadata(
	string key
)
Public Function DeleteMetadata (
	key As String
) As Boolean
Parameters
key
Type: System.String
The key of metadata.
Return Value
Type: Boolean
True if success or False if key not found or deletion failed.
Examples
public void SetMetaDataTest()
{
    var polymesh = CreateSomeValidBrep();
    var shapeItem = new ShapeItem
    {
        Name = "TestFileName",
        ShapeFacetedBrep = polymesh,
        UpAxis = ShapeUpAxis.Z_Axis
    };
    shapeItem.Insert();
    shapeItem.SetMetadata("test", ShapeMetadataTypeEnum.Text, "testvalue", "", "");
    shapeItem.DeleteMetadata("test");
}
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace